Revit 2027 API
ElectricalSystem.PhaseLabel Property
 The circuit phase label used in the Electrical System.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string PhaseLabel { get; }
Public ReadOnly Property PhaseLabel As String
	Get
public:
property String^ PhaseLabel {
	String^ get ();
}
member PhaseLabel : string with get
Property Value
String
Remarks
 This property is used to retrieve the phase label of the Electrical System on a panel.
See Also
Reference
ElectricalSystem Class
Autodesk.Revit.DB.Electrical Namespace